# Задание 1
# Создайте однотабличную базу данных People (имя,
# фамилия, город, страна, дата рождения) с одноименной
# таблицей. Напишите программу, которая позволяет пользователю ввести запрос и получить результаты работы
# запроса. В качестве запроса необходимо поддерживать
# только SELECT. При попытке выполнить другие запросы
# необходимо генерировать ошибку.

# Задание 2
# Добавьте к первому заданию возможность вставки,
# удаления и обновления данных с помощью запросов
# INSERT, DELETE, UPDATE. Перед исполнением запроса
# проверяйте корректность названия таблицы. Также запретите запрос на удаление всех строк и обновление всех
# строк (UPDATE и DELETE без условий).




# Задание 3
# Модифицируйте первое задание, чтобы пользователь
# не мог вводить запрос, а пользовался готовыми фильтрами. Например: отображение всех людей, отображение
# людей с возрастом в диапазоне, отображение всех людей
# из одного города (задаётся в качестве значения пользователем с клавиатуры), отображение всех людей из одной
# страны (задаётся в качестве параметра пользователем с
# клавиатуры).








# Задание 4
# Модифицируйте третье задание, чтобы фильтр для
# показа мог быть комплексным. Например, пользователь
# может указать фильтр на страну и город, после чего отобразятся люди, для которых сработает этот комплексный
# фильтр. Нужно поддержать условия И, ИЛИ.










# Задание 5
# Добавьте к четвертому заданию возможность вставки,
# удаления и обновления данных через интерфейс приложения. Пользователь не может ввести запросы INSERT,
# UPDATE, DELETE напрямую.






# Задание 6
# Добавьте к приложению возможность сохранять
# результаты работы фильтров в файл. Например, результат работы фильтра по отображению всех людей
# или результат работы фильтра по отображению людей
# из одного города.